In [61]:
# Import relevent liberies 
import pandas as pd 
import numpy as ny

In [62]:
# Loading basic-rating
basic = pd.read_csv('Data/title_basics.csv.gz')
basic.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0034413,short,Youth Gets a Break,Youth Gets a Break,0,2001,NaN,20,Short
1,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance"
2,tt0050396,short,Final Curtain,Final Curtain,0,2012,NaN,20,"Horror,Short"
3,tt0056840,short,Aufsätze,Aufsätze,0,2021,NaN,10,Short
4,tt0060361,short,EMS nr 1,EMS nr 1,0,2016,NaN,14,Short

In [63]:
## create a col with a list of genres
basic['genres_split'] = basic['genres'].str.split(',')
basic['genres_split']

0                                  [Short]
1               [Comedy, Fantasy, Romance]
2                          [Horror, Short]
3                                  [Short]
4                                  [Short]
                        ...
1224841           [Drama, Mystery, Sci-Fi]
1224842                            [Drama]
1224843                            [Drama]
1224844    [Family, Game-Show, Reality-TV]
1224845                            [Short]
Name: genres_split, Length: 1224846, dtype: object

In [64]:
#Use explode function
exploded_genres = basic.explode('genres_split')
exploded_genres

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0034413,short,Youth Gets a Break,Youth Gets a Break,0,2001,NaN,20,Short,Short
1,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance",Comedy
1,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance",Fantasy
1,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance",Romance
2,tt0050396,short,Final Curtain,Final Curtain,0,2012,NaN,20,"Horror,Short",Horror
...,...,...,...,...,...,...,...,...,...,...
1224843,tt9916730,movie,6 Gunn,6 Gunn,0,2017,NaN,116,Drama,Drama
1224844,tt9916766,tvEpisode,Episode #10.15,Episode #10.15,0,2019,NaN,43,"Family,Game-Show,Reality-TV",Family
1224844,tt9916766,tvEpisode,Episode #10.15,Episode #10.15,0,2019,NaN,43,"Family,Game-Show,Reality-TV",Game-Show
1224844,tt9916766,tvEpisode,Episode #10.15,Episode #10.15,0,2019,NaN,43,"Family,Game-Show,Reality-TV",Reality-TV
1224845,tt9916856,short,The Wind,The Wind,0,2015,NaN,27,Short,Short

In [65]:
unique_genres = sorted(exploded_genres['genres_split'].unique())
unique_genres

['Action',
 'Adult',
 'Adventure',
 'Animation',
 'Biography',
 'Comedy',
 'Crime',
 'Drama',
 'Family',
 'Fantasy',
 'Game-Show',
 'History',
 'Horror',
 'Music',
 'Musical',
 'Mystery',
 'News',
 'Reality-TV',
 'Romance',
 'Sci-Fi',
 'Short',
 'Sport',
 'Talk-Show',
 'Thriller',
 'War',
 'Western']

In [66]:
# Creating a new table from Genres
title_genres = exploded_genres[['tconst','genres_split']].copy()
title_genres.head()

      tconst genres_split
0  tt0034413        Short
1  tt0035423       Comedy
1  tt0035423      Fantasy
1  tt0035423      Romance
2  tt0050396       Horror

In [67]:
## Making the genre mapper dictionary
genre_ints = range(len(unique_genres))
genre_map = dict(zip(unique_genres, genre_ints))
genre_map

{'Action': 0,
 'Adult': 1,
 'Adventure': 2,
 'Animation': 3,
 'Biography': 4,
 'Comedy': 5,
 'Crime': 6,
 'Drama': 7,
 'Family': 8,
 'Fantasy': 9,
 'Game-Show': 10,
 'History': 11,
 'Horror': 12,
 'Music': 13,
 'Musical': 14,
 'Mystery': 15,
 'News': 16,
 'Reality-TV': 17,
 'Romance': 18,
 'Sci-Fi': 19,
 'Short': 20,
 'Sport': 21,
 'Talk-Show': 22,
 'Thriller': 23,
 'War': 24,
 'Western': 25}

In [68]:
genre_id_map = dict(zip(unique_genres,range(len(unique_genres))))
genre_id_map

{'Action': 0,
 'Adult': 1,
 'Adventure': 2,
 'Animation': 3,
 'Biography': 4,
 'Comedy': 5,
 'Crime': 6,
 'Drama': 7,
 'Family': 8,
 'Fantasy': 9,
 'Game-Show': 10,
 'History': 11,
 'Horror': 12,
 'Music': 13,
 'Musical': 14,
 'Mystery': 15,
 'News': 16,
 'Reality-TV': 17,
 'Romance': 18,
 'Sci-Fi': 19,
 'Short': 20,
 'Sport': 21,
 'Talk-Show': 22,
 'Thriller': 23,
 'War': 24,
 'Western': 25}

In [69]:
## make new integer genre_id and drop string genres
title_genres['genre_id'] = title_genres['genres_split'].map(genre_map)
title_genres = title_genres.drop(columns='genres_split')

In [70]:
title_genres.head()

      tconst  genre_id
0  tt0034413        20
1  tt0035423         5
1  tt0035423         9
1  tt0035423        18
2  tt0050396        12

In [71]:
genre_lookup =pd.DataFrame({'genre_name':genre_id_map.keys(),
                            'genre_Id' :genre_id_map.values()})
genre_lookup

    genre_name  genre_Id
0       Action         0
1        Adult         1
2    Adventure         2
3    Animation         3
4    Biography         4
5       Comedy         5
6        Crime         6
7        Drama         7
8       Family         8
9      Fantasy         9
10   Game-Show        10
11     History        11
12      Horror        12
13       Music        13
14     Musical        14
15     Mystery        15
16        News        16
17  Reality-TV        17
18     Romance        18
19      Sci-Fi        19
20       Short        20
21       Sport        21
22   Talk-Show        22
23    Thriller        23
24         War        24
25     Western        25

In [72]:
basic.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0034413,short,Youth Gets a Break,Youth Gets a Break,0,2001,NaN,20,Short,[Short]
1,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance","[Comedy, Fantasy, Romance]"
2,tt0050396,short,Final Curtain,Final Curtain,0,2012,NaN,20,"Horror,Short","[Horror, Short]"
3,tt0056840,short,Aufsätze,Aufsätze,0,2021,NaN,10,Short,[Short]
4,tt0060361,short,EMS nr 1,EMS nr 1,0,2016,NaN,14,Short,[Short]

In [73]:
basic = basic[['tconst','primaryTitle','startYear','endYear','runtimeMinutes']]
basic.head()

      tconst        primaryTitle  startYear  endYear  runtimeMinutes
0  tt0034413  Youth Gets a Break       2001      NaN              20
1  tt0035423      Kate & Leopold       2001      NaN             118
2  tt0050396       Final Curtain       2012      NaN              20
3  tt0056840            Aufsätze       2021      NaN              10
4  tt0060361            EMS nr 1       2016      NaN              14

In [74]:
ratings = pd.read_csv('Data/title_ratings.csv.gz')
ratings.head()

      tconst  averageRating  numVotes
0  tt0000001            5.7      2002
1  tt0000002            5.8       269
2  tt0000003            6.5      1894
3  tt0000004            5.5       178
4  tt0000005            6.2      2677

In [75]:
# loading `TMBD Api Result 
tmdb_Api = pd.read_csv('Data/Datatmdb_results_combined.csv.gz')
tmdb_Api.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2620 entries, 0 to 2619
Data columns (total 26 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   imdb_id                2620 non-null   object
 1   adult                  2618 non-null   float64
 2   backdrop_path          1467 non-null   object
 3   belongs_to_collection  212 non-null    object
 4   budget                 2618 non-null   float64
 5   genres                 2618 non-null   object
 6   homepage               172 non-null    object
 7   id                     2618 non-null   float64
 8   original_language      2618 non-null   object
 9   original_title         2618 non-null   object
 10  overview               2566 non-null   object
 11  popularity             2618 non-null   float64
 12  poster_path            2376 non-null   object
 13  production_companies   2618 non-null   object
 14  production_countries   2618 non-null   object
 15  release_date           2595 non-null   object
 16  revenue                2618 non-null   float64
 17  runtime                2618 non-null   float64
 18  spoken_languages       2618 non-null   object
 19  status                 2618 non-null   object
 20  tagline                1129 non-null   object
 21  title                  2618 non-null   object
 22  video                  2618 non-null   float64
 23  vote_average           2618 non-null   float64
 24  vote_count             2618 non-null   float64
 25  certification          815 non-null    object
dtypes: float64(9), object(17)
memory usage: 532.3+ KB

In [76]:
tmdb_Api =tmdb_Api[['imdb_id','budget','revenue','certification']]
tmdb_Api.head()

     imdb_id      budget     revenue certification
0          0         NaN         NaN           NaN
1  tt0113026  10000000.0         0.0           NaN
2  tt0113092         0.0         0.0           NaN
3  tt0116391         0.0         0.0           NaN
4  tt0118694    150000.0  14204632.0            PG

In [77]:
# checking datatype tmdb_Api
tmdb_Api.dtypes

imdb_id           object
budget           float64
revenue          float64
certification     object
dtype: object

In [78]:
# Checking datatype for ratings
ratings.dtypes

tconst            object
averageRating    float64
numVotes           int64
dtype: object

In [79]:
# Checking datatype for basic
basic.dtypes

tconst             object
primaryTitle       object
startYear           int64
endYear           float64
runtimeMinutes      int64
dtype: object

In [80]:
import pandas as pd
import pymysql
pymysql.install_as_MySQLdb()
from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists

from urllib.parse import quote_plus as urlquote
from sqlalchemy.engine import create_engine

In [81]:
# Create connection string using credentials following this format
# connection = "dialect+driver://username:password@host:port/database"
username = 'root'
password = 'Lelozizi@1059' # (or whatever password you chose during mysql installation)
db_name = 'movies'

connection_str = f"mysql+pymysql://{'root'}:{urlquote('Lelozizi@1059**')}@localhost/{db_name}"

In [82]:
engine = create_engine(connection_str)
engine

Engine(mysql+pymysql://root:***@localhost/movies)

In [83]:
# Check if the database exists. If not, create it.
if database_exists(connection_str) == False:
  create_database(connection_str)
else:
  print('The database already exists')

The database already exists

In [84]:
basic.head()

      tconst        primaryTitle  startYear  endYear  runtimeMinutes
0  tt0034413  Youth Gets a Break       2001      NaN              20
1  tt0035423      Kate & Leopold       2001      NaN             118
2  tt0050396       Final Curtain       2012      NaN              20
3  tt0056840            Aufsätze       2021      NaN              10
4  tt0060361            EMS nr 1       2016      NaN              14

In [85]:
## load
from sqlalchemy.types import *
## Calculate max string lengths for object columns
key_len = basic['tconst'].fillna('').map(len).max()
title_len = basic['primaryTitle'].fillna('').map(len).max()
## Create a schema dictonary using Sqlalchemy datatype objects
df_schema = {
    "tconst": String(key_len+1), 
    "primaryTitle": Text(title_len+1),
    'startYear':Float(),
    'endYear':Float(),
    'runtimeMinutes':Integer()}

In [86]:
# Save to sql with dtype and index=False
basic.to_sql('title_basics',engine,dtype=df_schema,if_exists='replace',index=False)

1224846

ratings schema

In [87]:
# creating schema for rating 
key_len = ratings['tconst'].fillna('').map(len).max()
## Create a schema dictonary using Sqlalchemy datatype objects
df_schemarating = {
    "tconst": String(key_len+1), 
    'averageRating':Float(),
    'numVotes':Integer()}

In [88]:
# Save to sql with dtype and index=False
ratings.to_sql('title_ratings',engine,dtype=df_schemarating,if_exists='replace',index=False)

1360911

tmdb_Api schema

In [89]:
# creating schema for tmdb_Api
key_len = tmdb_Api['imdb_id'].fillna('').map(len).max()
cert_len = tmdb_Api['certification'].fillna('').map(len).max()
## Create a schema dictonary using Sqlalchemy datatype objects
df_schema = {
    "imdb_id": String(key_len+1), 
    "budget": Float(),
    'revenue':Float(),
    'certification':Text(cert_len+1)}

In [90]:
# Save to sql with dtype and index=False
tmdb_Api.to_sql('tmdb_data',engine,dtype=df_schema,if_exists='replace',index=False)

2620

In [91]:
# Checking genre dttype 
genre_lookup.dtypes

genre_name    object
genre_Id       int64
dtype: object

In [92]:
# creating schema for genre
name_len = genre_lookup['genre_name'].fillna('').map(len).max()
## Create a schema dictonary using Sqlalchemy datatype objects
df_schemagenre = {
    "genre_Id": Integer(), 
    'genre_name':Text(name_len+1)}

In [93]:
# Save to sql with dtype and index=False
genre_lookup.to_sql('genra',engine,dtype=df_schemagenre,if_exists='replace',index=False)

26

In [94]:
#engine.execute('ALTER TABLE movies.genra ADD PRIMARY KEY (`genre_Id`);')

In [95]:
title_genres.dtypes

tconst      object
genre_id     int64
dtype: object

Title_Genre Schema

In [96]:
# creating schema for title_genre
key_len = basic['tconst'].fillna('').map(len).max()
## Create a schema dictonary using Sqlalchemy datatype objects
df_schema = {
    "tconst": String(key_len+1), 
    'genre_id':Integer()}

In [97]:
# Save to sql with dtype and index=False
title_genres.to_sql('title_genres',engine,dtype=df_schema,if_exists='replace',index=False)

2340284

In [98]:
# show tables
q = """SHOW TABLES;"""
pd.read_sql(q, engine)

  Tables_in_movies
0            genra
1     title_basics
2     title_genres
3    title_ratings
4        tmdb_data

In [99]:
q1 = """SELECT * FROM movies.genra LIMIT 5;"""
pd.read_sql(q1, engine)

  genre_name  genre_Id
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

In [100]:
# Querying title_basics
q2 = """SELECT * FROM movies.title_basics LIMIT 5;"""
pd.read_sql(q2, engine)

      tconst        primaryTitle  startYear endYear  runtimeMinutes
0  tt0034413  Youth Gets a Break     2001.0    None              20
1  tt0035423      Kate & Leopold     2001.0    None             118
2  tt0050396       Final Curtain     2012.0    None              20
3  tt0056840            Aufsätze     2021.0    None              10
4  tt0060361            EMS nr 1     2016.0    None              14

In [101]:
#Querying title_genres

q3 = """SELECT * FROM movies.title_genres LIMIT 5;"""
pd.read_sql(q3, engine)

      tconst  genre_id
0  tt0034413        20
1  tt0035423         5
2  tt0035423         9
3  tt0035423        18
4  tt0050396        12

In [102]:
#Querying title_genres

q4 = """SELECT * FROM movies.title_ratings LIMIT 5;"""
pd.read_sql(q4, engine)

      tconst  averageRating  numVotes
0  tt0000001            5.7      2002
1  tt0000002            5.8       269
2  tt0000003            6.5      1894
3  tt0000004            5.5       178
4  tt0000005            6.2      2677

In [104]:
#Querying title_genres

q5 = """SELECT * FROM movies.tmdb_data LIMIT 5;"""
pd.read_sql(q5, engine)

     imdb_id      budget     revenue certification
0          0         NaN         NaN          None
1  tt0113026  10000000.0         0.0          None
2  tt0113092         0.0         0.0          None
3  tt0116391         0.0         0.0          None
4  tt0118694    150000.0  14204600.0            PG